Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: (Irreflexivity)
ja: （非反射）

source: (Reflexivity)
ja: （反射性）

source: (Symmetry)
ja: （対称性）

source: (Transitive comparability)
ja: （推移的比較性）

source: (Transitive incomparability)
ja: （推移的比較不能性）

source: (Transitivity)
ja: （推移性）

source: CheckedContinuation performs runtime checks for missing or multiple resume operations.
ja: CheckedContinuationは、見つからないまたは複数の再開操作に対する実行時検査を実行します。

source: StaticString provides only low-level access to its contents, unlike Swift’s more commonly used String type.
ja: StaticStringは、それの内容への低レベルアクセスのみを提供します、Swiftのもつより一般的に使われるString型とは違って。

source: SystemRandomNumberGenerator is automatically seeded, is safe to use in multiple threads, and uses a cryptographically secure algorithm whenever possible.
ja: SystemRandomNumberGeneratorは、自動的にシードをえらびます、複数のスレッドにおける使用を安全にします、そして可能な時はいつでも暗号化保安アルゴリズムを使います。

source: T.min.isMultiple(of: -1) is true for signed integer T, even though the quotient T.min / -1 isn’t representable in type T.
ja: T.min.isMultiple(of: -1)はtrueです、符号付き整数Tに対して、たとえ商T.min / -1が型Tで表現可能でなくてさえ。

source: Task also provides appropriate context-sensitive static functions which operate on the “current” task, which might either be a detached task or a child task.
ja: Taskはまた、“現在の” タスク上で作動する適切な文脈依存の静的関数いくつかを提供します、それは分離タスクまたは子タスクのどちらかかもしれません。

source: \(foo: x) translates to appendInterpolation(foo: x)
ja: \(foo: x)はappendInterpolation(foo: x)に翻訳されます

source: \(x) translates to appendInterpolation(x)
ja: \(x)はappendInterpolation(x)に翻訳されます

source: \(x, foo: y) translates to appendInterpolation(x, foo: y)
ja: \(x, foo: y)はappendInterpolation(x, foo: y)に翻訳されます

source: \(x, y) translates to appendInterpolation(x, y)
ja: \(x, y)はappendInterpolation(x, y)に翻訳されます

source: alignment must be a whole power of 2.
ja: alignmentは２の整冪でなければなりません。

source: appendInterpolation methods support virtually all features of methods: they can have any number of parameters, can specify labels for any or all of their parameters, can provide default values, can have variadic parameters, and can have parameters with generic types.
ja: appendInterpolationメソッドそれらは、メソッドの全ての機能を事実上サポートします：それらは、どんな数のパラメータでも持つことができます、それらのパラメータのいくらかまたは全てにラベルを指定できます、省略時の値を提供できます、可変長引数を持つことができます、そして総称体型をもつパラメータを持つことができます。

source: areEquivalent(a, a) is always true.
ja: areEquivalent(a, a)は常にtrueである。

source: areEquivalent(a, b) implies areEquivalent(b, a).
ja: areEquivalent(a, b)はareEquivalent(b, a)を意味する。

source: areInIncreasingOrder(a, a) is always false.
ja: areInIncreasingOrder(a, a)は常にfalseである。

source: areInIncreasingOrder must be a strict weak ordering over the elements.
ja: areInIncreasingOrderは、それら要素に対して厳密弱順序でなければなりません。

source: as, as?, and as!
ja: as, as?, および as!

source: byteCount must not be negative.
ja: byteCountは、負であってはなりません。

source: count must be greater than or equal to zero.
ja: countは、ゼロより大きいか等しくなければなりません。

source: count must not be negative.
ja: countは負数であってはいけません。

source: elements must be finite.
ja: elementsは有限でなければなりません。

source: end must be a valid index of the collection.
ja: endはコレクションのひとつの有効なインデックスでなければなりません。

source: hashValue is deprecated as a Hashable requirement.
ja: hashValueは、Hashable要件として非推奨にされます。

source: i must be a valid index of the string that is not equal to the string’s end index.
ja: iは、この文字列の有効なインデックスでなければなりません、そしてこの文字列の持つ末尾インデックスと等しくてはなりません。

source: i must be greater than startIndex.
ja: iはstartIndexより大きくなければなりません。

source: i must be in the range 0..<count.
ja: iは、範囲0..<countの中でなければなりません。

source: i must be less than endIndex.
ja: iはendIndexより少なくなければなりません。

source: i must be less than the string’s end index.
ja: iは文字列の末尾インデックスより少なくなければなりません。

source: index must be a valid index into the collection.
ja: indexはコレクションに対する有効なインデックスでなければなりません。

source: index must be a valid index of the collection that is not equal to the collection’s end index.
ja: indexは、このコレクションの有効なインデックスでなければなりません、そしてこのコレクションの持つ末尾インデックスと等しくてはなりません。

source: index must be a valid index of the collection.
ja: indexはコレクションの有効なインデックスでなければなりません。

source: index must be in the range 0..<scalarCount.
ja: indexは、範囲0..<scalarCountの中になければなりません。

source: initialResult is passed to nextPartialResult the first time the closure is executed.
ja: initialResultはnextPartialResultに、クロージャが実行される最初の時に渡されます。

source: input must be the same iterator instance in repeated calls to this method.
ja: inputは、このメソッドに対して繰り返される呼び出しにおいて同じイテレータでなければなりません。

source: k must be greater than or equal to zero and must not exceed the number of elements in the collection.
ja: kは、ゼロより大きいか等しくなければなりません、そしてコレクションの中の要素の数を越えてはいけません。

source: k must be greater than or equal to zero, and must be less than or equal to the number of elements in the collection.
ja: kは、ゼロより大きいか等しくなければなりません、そしてコレクションの要素数より少ないか等しくなければなりません。

source: k must be greater than or equal to zero.
ja: kは、ゼロより大きいか等しくなければなりません。

source: length is the number of underlying code units consumed by this error, guaranteed to be greater than 0.
ja: lengthは、このエラーによって消費される、基礎をなすコード単位の数です、０より大きいことを保証されます。

source: maxLength must be greater than or equal to zero.
ja: maxLengthは、ゼロより大きいか等しくなければなりません。

source: n must be greater than or equal to zero.
ja: nは、ゼロより大きいか等しくなければなりません。

source: offset must be nonnegative.
ja: offsetは、非負でなければなりません。

source: position must be a valid index of the collection that is not equal to the endIndex property.
ja: positionはコレクションの有効なインデックスで、endIndexプロパティと等しくないものでなければなりません。

source: position must be a valid index of the collection that is not equal to the collection’s end index.
ja: positionは、このコレクションの有効なインデックスでなければなりません、そしてこのコレクションの持つ末尾インデックスと等しくてはなりません。

source: position must be less than the view’s end index.
ja: positionはこのビューの末尾インデックスより少なくなければなりません。

source: radix must be at least 2 and at most 36.
ja: radix基数は少なくとも２そして多くて36でなければなりません。

source: range must not be empty.
ja: rangeは空であってはいけません。

source: scalars must have the same number of elements as the vector type.
ja: scalarsは、ベクター型と同じ数の要素を持たなければなりません。

source: source must be representable in this type after rounding toward zero.
ja: sourceは、ゼロへの丸め後にこの型において表現可能でなければなりません。

source: source.count must be less than or equal to this buffer’s count.
ja: source.countは、このバッファのもつcountより少ないか等しくなければなりません。

source: start must be a valid index of the collection.
ja: startはコレクションのひとつの有効なインデックスでなければなりません。

source: transform accepts an element of this sequence as its parameter and returns a transformed value of the same or of a different type.
ja: transformはこのシーケンスのひとつの要素をそれのパラメータとして受け取り、同じもしくは異なる型の変換された値を返します。

source: transform accepts an element of this sequence as its parameter and returns an AsyncSequence.
ja: transformはこのシーケンスのある要素をそれのパラメータとして受け取り、そしてAsyncSequenceを返します。

source: true if byte is a continuation byte; otherwise, false.
ja: byteが継続バイトならばtrue；そうでなければ、false。

source: true if i has been offset by exactly distance steps without going beyond limit; otherwise, false.
ja: true、もしiが正確にdistance幅だけlimitを越えていくことなく補われたならば；そうでなければ、falseです。

source: true if lhs is greater than or equal to rhs; otherwise, false.
ja: trueを、lhsがrhsより大きいか等しいならば返します；そうでなければ、false。

source: true if x is a high-surrogate code unit; otherwise, false.
ja: xが高位サロゲートコード単位ならばtrue；そうでなけれぱfalse。

source: true if x is a low-surrogate code unit; otherwise, false.
ja: xが低位サロゲートコード単位ならばtrue；そうでなけれぱfalse。

source: true if the element was found in the sequence; otherwise, false.
ja: 要素がシーケンスにおいて見つけられなかったならば、true；そうでなければ、false。

source: true if the group has no pending tasks; otherwise false.
ja: true、もしグループが未解決タスクを持たないならば；そうでなければfalse。

source: true if the initial elements of the sequence are equivalent to the elements of possiblePrefix; otherwise, false.
ja: true、もしシーケンスの冒頭の要素がpossiblePrefixの要素と等しいならば；そうでなければfalse。

source: true if the initial elements of the sequence are the same as the elements of possiblePrefix; otherwise, false.
ja: true、もしシーケンスの冒頭の要素がpossiblePrefixの要素と同じならば；そうでなければfalse。

source: true if the method found the element in the asynchronous sequence; otherwise, false.
ja: true、もしメソッドがその要素をこの非同期シーケンスの中で見つけたならば；そうでなければ、false。

source: true if the operation was added to the group successfully, false otherwise (e.g. because the group isCancelled)
ja: 演算がグループにうまく加えられたならば、true、そうでなければfalse（たとえば、グループがisCancelledされたから）。

source: true if the sequence contains an element that satisfies predicate; otherwise, false.
ja: このシーケンスがpredicateを満たす要素を含むならばtrue；そうでなければ、false。

source: true if the sequence contains only elements that satisfy predicate; otherwise, false.
ja: true、もしシーケンスがpredicateを満たす要素のみを含むならば；そうでなければ、false。

source: true if the string begins with prefix; otherwise, false.
ja: true、文字列がprefixで始まるならば；そうでなければ、false。

source: true if the string ends with suffix; otherwise, false.
ja: true、もし文字列がsuffixで終わるならば；そうでなければ、false。

source: true if this sequence and other contain equivalent items, using areEquivalent as the equivalence test; otherwise, false.
ja: true、このシーケンスとotherがareEquivalentを同等性テストとして使って同じ要素らを含むならば；そうでなければ、false。

source: true if this sequence and other contain the same elements in the same order.
ja: このシーケンスとotherが同じ要素を同じ順序で含んでいるならば、true。

source: true if this sequence precedes other in a dictionary ordering as ordered by areInIncreasingOrder; otherwise, false.
ja: true、もしこのシーケンスがotherに、areInIncreasingOrderによって並べられる通りの字典順序において先行するならば；そうでなければ、false。

source: true if this sequence precedes other in a dictionary ordering; otherwise, false.
ja: このシーケンスがotherに、ある字典順序において先行するならば、true；そうでなければ、false。

source: v must be a valid Unicode scalar value, in the ranges 0...0xD7FF or 0xE000...0x10FFFF.
ja: vは、有効なユニコードスカラー値、0...0xD7FFおよび0xE000...0x10FFFFの範囲でなければなりません。

source: x must be represented by a surrogate pair when encoded in UTF-16.
ja: xは、UTF-16でエンコードされる時あるサロゲートペアで表現されなければなりません。

source: x.isMultiple(of: 0) is true if x is zero and false otherwise.
ja: x.isMultiple(of: 0)はtrueです、もしxがゼロであるならば、そしてそうでなければfalseです。

source: count must be zero or greater.
ja: countは、ゼロまたはより大きくなければなりません。

source: distance must not be negative unless the collection conforms to the BidirectionalCollection protocol.
ja: distanceは、そのコレクションがBidirectionalCollectionプロトコルに準拠するのでない限り、負であってはなりません。

source: n must not be negative unless the collection conforms to the BidirectionalCollection protocol.
ja: nは、そのコレクションがBidirectionalCollectionプロトコルに準拠するのでない限り、負であってはなりません。

source: radix must be in the range 2...36.
ja: radixは、範囲2...36の中でなければなりません。

source: rhs must not be zero.
ja: rhsは、ゼロではなりません。

source: sourcePosition must be a valid index of at least one of the views of target.
ja: sourcePositionは、targetの少なくとも１つのビューの有効なインデックスでなければなりません。

source: transform can also throw an error, which ends the transformed sequence.
ja: transformはまたエラーをスローできます、それは変換されたシーケンスを終わらせます。

source: utf16Index must be an element of String(unicodeScalars).utf16.indices.
ja: utf16Indexは、String(unicodeScalars).utf16.indicesの要素でなければなりません。

source: DefaultPrecedence has no associativity and a precedence immediately higher than TernaryPrecedence.
ja: DefaultPrecedenceは、TernaryPrecedenceのすぐ上の結合性と優先順位を持ちません。

source: UnsafeContinuation avoids enforcing these invariants at runtime because it aims to be a low-overhead mechanism for interfacing Swift tasks with event loops, delegate methods, callbacks, and other non-async scheduling mechanisms.
ja: UnsafeContinuationは、それら不変式を実行時に遵守させることを避けます、なぜならそれはイベントループを備えるSwiftタスク、委任メソッド、コールバック、そして他の非asyncスケジューリング機構を取り持つことに対して低オーバーヘッド機構であるように努力するからです。

source: maxSplits must be greater than or equal to zero.
ja: maxSplitsは、ゼロより大きいか等しくなければなりません。

source: UnsafePointer provides no automated memory management or alignment guarantees.
ja: UnsafePointerは、自動メモリ管理またはアラインメント保証を提供しません。

source: n may be positive, negative, or zero.
ja: nは、正、負、またはゼロが許されます。

source: UnsafeMutablePointer provides no automated memory management or alignment guarantees.
ja: UnsafeMutablePointerは、自動メモリ管理またはアラインメント保証を提供しません。

source: Initialized memory has a value that can be read using a pointer’s pointee property or through subscript notation.
ja: 初期化済メモリは、pointeeプロパティまたは添え字表記法を使って読み出し可能な値を持ちます。

source: String interpolations are string literals that evaluate any included expressions and convert the results to string form.
ja: 文字列補間は文字列リテラルです、それは、何らかの含まれた式を評価して、その結果を文字列形式へ変換します。

source: Required. Default implementation provided.
ja: 必須。 省略時の実装の提供。

source: Required. Default implementations provided.
ja: 必須。 いくつかの省略時の実装の提供。

source: See Also
ja: 参照

source: A 16-bit signed integer value type.
ja: 16ビット符号つき整数値型。

source: A 16-bit unsigned integer value type.
ja: 16ビット符号なし整数値型。

source: A 32-bit floating point type.
ja: 32ビット浮動小数点型。

source: A 32-bit signed integer value type.
ja: 32ビット符号つき整数値型。

source: A 32-bit unsigned integer value type.
ja: 32ビット符号なし整数値型。

source: A 64-bit floating point type.
ja: 64ビット浮動小数点型。

source: A 64-bit signed integer value type.
ja: 64ビット符号付き整数値型。

source: A 64-bit unsigned integer value type.
ja: 64ビット符号なし整数値型。

source: A Collection that provides its own implementation of this method must also guarantee that an equivalent buffer of its SubSequence can be generated by advancing the pointer by the distance to the slice’s startIndex.
ja: このメソッドのそれ独自の実装を提供するCollectionはまた、それのSubSequenceの同等のバッファが、スライスのもつstartIndexへの隔たりだけポインタを前進することによって生成されることを保証しなければなりません。

source: A Collection whose elements consist of those in a Base Collection passed through a transform function returning Element.
ja: あるCollection、その要素はBase Collectionの中のものから成り、Elementを返す変換関数を通して渡されます。

source: A Result.success value containing the value that the child task returned, or a Result.failure value containing the error that the child task threw.
ja: 子タスクが返した値を含んでいるResult.success値、または子タスクがスローしたエラーを含んでいるResult.failure値。

source: A Sequence that can contain the same elements as this one, possibly with a simpler type.
ja: このものと同じ要素を、できる限りより簡単な型で、含むSequence。

source: A Sequence whose elements consist of those in a Base Sequence passed through a transform function returning Element.
ja: あるSequence、その要素はBase Sequencellectionの中のものから成り、Elementを返す変換関数を通して渡されます。

source: A String value, if Type is Int8 or UInt8.
ja: String値、もしTypeがInt8またはUInt8ならば。

source: A T was parsed successfully
ja: Tがうまく構文解析された

source: A UnicodeDecodingResult instance, representing the next Unicode scalar, an indication of an error, or an indication that the UTF sequence has been fully decoded.
ja: 次のユニコードスカラー、エラーの症状、またはUTFシーケンスが完全にデコードされた徴を表している、あるUnicodeDecodingResultインスタンス。

source: A [Type] value, which is passed as a pointer to the start of the array.
ja: [Type]値、それは配列の始まりへのポインタとして渡されます。

source: A ReversedCollection instance wraps an underlying collection and provides access to its elements in reverse order.
ja: ReversedCollectionインスタンスは、基礎をなすコレクションをラップして、それの要素へのアクセスを逆順で提供します。

source: A continuation is an opaque representation of program state.
ja: ある継続は、プログラム状態の不透明表現です。

source: A string literal is a series of characters enclosed in quotes.
ja: 文字列リテラルは、引用符に囲まれた一連の文字です。

source: A trivial type can be copied bit for bit with no indirection or reference-counting operations.
ja: 自明な型は、ビット対ビットでコピーされることが、何らかの間接参照または参照カウント操作なしで可能です。

source: A Boolean value indicating whether a string has no characters.
ja: ある文字列が文字をひとつも持たないかどうかを指し示すブール値。

source: A Boolean value indicating whether the Unicode scalar is an ASCII character.
ja: このユニコードスカラーがあるASCII文字であるかどうかを指し示すブール値。

source: A Boolean value indicating whether the collection is empty.
ja: コレクションが空かどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar has a “soft dot” that disappears when a diacritic is placed over the scalar.
ja: 区別的発音符がスカラーにかぶせて置かれる時に姿を消す “ソフトドット” を、このスカラーが持つかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar has an emoji presentation, whether or not it is the default.
ja: このスカラーがemoji提示物を持つかどうか、それが初期設定であるかそうでないか、を指し示すブール値。

source: A Boolean value indicating whether the scalar is a default-ignorable code point.
ja: このスカラーがある省略時無視可能なコード点かどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is a diacritic.
ja: このスカラーが区別的発音符であるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is a format control character that has a specific function in controlling cursive joining and ligation.
ja: そのスカラーが特定の機能を筆記体の結合と合字の制御において持つ書式制御文字かどうかを指し示しているあるブール値。

source: A Boolean value indicating whether the scalar is a format control character that has a specific function in the Unicode Bidrectional Algorithm.
ja: このスカラーがある特定の機能を「ユニコード双方向アルゴリズム」において持つ書式制御文字であるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is a grapheme base.
ja: このユニコードスカラーがある書記素基底であるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is a grapheme extender.
ja: このスカラーが書記素拡張かどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is a punctuation mark that generally marks the end of a sentence.
ja: このスカラーが一般的に文の終わりを印する句読点符号であるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is a punctuation symbol explicitly called out as a dash in the Unicode Standard or a compatibility equivalent.
ja: このスカラーがユニコード標準またはある互換相当物においてダッシュとして明示的に召集される句読点シンボルであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is a punctuation symbol that typically marks the end of a textual unit.
ja: このスカラーが概してテキスト単位の終わりを印する句読点シンボルであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is a radical component of CJK characters, Tangut characters, or Yi syllables.
ja: このスカラーがCJK文字、西夏（タングート）文字、またはイ文字音節の根本的な構成要素かどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is a variation selector.
ja: このスカラーが異体字セレクタであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is a whitespace character.
ja: このスカラーが空白文字であるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is alphabetic.
ja: このスカラーがアルファベットであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is an ASCII character commonly used for the representation of hexadecimal numbers.
ja: このスカラーが16進数の表現に一般に使われるASCII文字であるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is an ideographic description character that determines how the three ideographic characters or ideographic description sequences that follow it are to be combined to form a single character.
ja: このスカラーが３つの表意文字またはそれに続く表意文字記述シーケンスが結び付けられて単一の文字を形成する方法を決定する表意文字記述文字かどうかを指し示すブール値。。

source: A Boolean value indicating whether the scalar is an ideographic description character that determines how the two ideographic characters or ideographic description sequences that follow it are to be combined to form a single character.
ja: このスカラーが２つの表意文字またはそれに続く表意文字記述シーケンスが結び付けられて単一の文字を形成する方法を決定する表意文字記述文字かどうかを指し示すブール値。。

source: A Boolean value indicating whether the scalar is considered to be a CJKV (Chinese, Japanese, Korean, and Vietnamese) or other siniform (Chinese writing-related) ideograph.
ja: そのスカラーが、CJKV（中国語、日本語、朝鮮語、そしてベトナム語）または他のスィーニー体（中国語筆記関連）表意文字であると考えられるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is considered to be either lowercase, uppercase, or titlecase.
ja: このスカラーがローワーケース、アッパーケース、またはタイトルケースのどれかであると考えられるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is deprecated.
ja: このスカラーが非推奨であるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is excluded from composition when performing Unicode normalization.
ja: このスカラーがユニコード正規化を実行する時に構成から除外されるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is ignored for casing purposes.
ja: このスカラーがケーシング意図に対して無視されるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is mirrored in bidirectional text.
ja: このスカラーが双方向テキストにおいて正確に映し出されるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is one of the unified CJK ideographs in the Unicode Standard.
ja: このスカラーがユニコード標準における統一CJK表意文字の１つであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is one that can modify a base emoji that precedes it.
ja: このスカラーがそれに先行するある基底emojiを修正できるものであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is one that is commonly used for the representation of hexadecimal numbers or a compatibility equivalent.
ja: このスカラーが16進数の表現またはある互換相当物に一般に使われるものであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is one that is not identical to its NFKC case-fold mapping.
ja: そのスカラーが、それのNFKCケースフォルド・マッピングと同一ではないものであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is one that is used in writing to surround quoted text.
ja: このスカラーが引用テキストを囲むために筆記において使われるものであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is one that naturally appears in mathematical contexts.
ja: このスカラーが数学的文脈において自然に現れるものであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is one that should be rendered with an emoji presentation, rather than a text presentation, by default.
ja: このスカラーが初期状態で、テキスト提示物ではなく、emoji提示物で描出されるべきものであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is one which is recommended to be allowed to appear in a non-starting position in a programming language identifier, with adjustments made for NFKC normalized form.
ja: このスカラーがプログラム言語識別子において始まりでない位置で現れるのを許可されることを推奨されるものであるかどうかを指し示すブール値、NFKC正規化形式に対する調整がなされます。

source: A Boolean value indicating whether the scalar is one which is recommended to be allowed to appear in a non-starting position in a programming language identifier.
ja: このスカラーがプログラム言語識別子において始まりでない位置で現れるのを許可されることを推奨されるものであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is one which is recommended to be allowed to appear in a starting position in a programming language identifier, with adjustments made for NFKC normalized form.
ja: このスカラーがプログラム言語識別子において始まりの位置で現れるのを許可されることを推奨されるものであるかどうかを指し示すブール値、NFKC正規化形式に対する調整がなされます。

source: A Boolean value indicating whether the scalar is one which is recommended to be allowed to appear in a starting position in a programming language identifier.
ja: このスカラーがプログラム言語識別子において始まりの位置で現れるのを許可されることを推奨されるものであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is one whose appearance can be changed by an emoji modifier that follows it.
ja: このスカラーがそれに続くあるemoji修飾子によってそれの外観が変更可能なものであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is permanently reserved for internal use.
ja: このスカラーが内部的な利用に対して永続的に予約されるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is recommended to be treated as whitespace when parsing patterns represented in source code.
ja: このスカラーがソースコードにおいて表されるパターンを構文解析する時に空白として扱われることを推奨されるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar is recommended to have syntactic usage in patterns represented in source code.
ja: このスカラーがソースコードにおいて表されるパターンで統語論的な利用法を持つことを推奨されるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar may change when it undergoes case mapping.
ja: このスカラーがケースマッピングを受ける時に変化するかもしれないかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar requires special handling for operations involving ordering, such as sorting and searching.
ja: このスカラーがソートおよび検索のような順序付けを発動する演算に対して特別な取り扱いを要求するかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar’s letterform is considered lowercase.
ja: このスカラーのもつ字形がローワーケースと考えられるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar’s letterform is considered uppercase.
ja: このスカラーのもつ字形がアップケースと考えられるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar’s normalized form differs from the lowercaseMapping of each constituent scalar.
ja: このスカラーのもつ正規化形式が、各構成スカラーのlowercaseMappingと異なるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar’s normalized form differs from the titlecaseMapping of each constituent scalar.
ja: このスカラーのもつ正規化形式が、各構成スカラーのtitlecaseMappingと異なるかどうかを指し示すブール値。
